Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/**
 * @file cy_aws_ota_storage.c
 *  Implements storage interface APIs for AWS OTA.
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "cy_ota_storage.h"
#include "cy_ota_crypto.h"
#include "cy_aws_iot_sdk_port_log.h"

/* RTOS includes */
#include "cyabs_rtos.h"

/* Utility API's needs */

#include "cy_ota_utils.h"
#include "ota_appversion32.h"

#ifdef CY_OTA_FLASH_SUPPORT
/* Added for Flash Read */
#include "untar.h"
#include "flash_map_backend/flash_map_backend.h"
#include "sysflash/sysflash.h"
#include "bootutil/bootutil.h"
#include "bootutil_priv.h"
#include "cy_smif_psoc6.h"
#endif

/* Added the below defines to resolve ARMC6 linker errors. Check this issue with Amazon team. */
#if defined(__ARMCC_VERSION)
#ifndef CY_OTA_FLASH_SUPPORT
// Version of the app
#ifndef APP_VERSION_MAJOR
#define APP_VERSION_MAJOR    1
#endif

#ifndef APP_VERSION_MINOR
#define APP_VERSION_MINOR    0
#endif

#ifndef APP_VERSION_BUILD
#define APP_VERSION_BUILD    0
#endif

/* Firmware version. */
const AppVersion32_t appFirmwareVersion =
{
    .u.x.major = APP_VERSION_MAJOR,
    .u.x.minor = APP_VERSION_MINOR,
    .u.x.build = APP_VERSION_BUILD,
};
#endif //CY_OTA_FLASH_SUPPORT

void static_assert(int p, void *a)
{
     return;
}

#endif // __ARMCC_VERSION

/* File type in the tarball */
#define CY_FILE_TYPE_SPE                    "SPE"     /* Secure Programming Environment (TFM) code type               */
#define CY_FILE_TYPE_NSPE                   "NSPE"    /* Non-Secure Programming Environment (application) code type   */

typedef struct cy_awsport_ota_flash_ctx
{
    const OtaFileContext_t *ota_fs_ctx;                /**< OTA PAL layer handle. Used to keep track of system context between calls from the OTA Agent. */
    cy_ota_type_t           ota_type;                  /**< OTA type. Value indicates its Host OTA or Device OTA. */
    uint32_t                ota_flash_start_address;   /**< OTA flash region starting address. */
    uint32_t                ota_flash_read_offset;     /**< Current read offset for OTA/HOTA image. */
    cy_mutex_t              ota_sync_mutex;            /**< Mutex for synchronizing OTA calls. */
} cy_awsport_ota_flash_ctx_t;

cy_awsport_ota_flash_ctx_t cy_aws_ota_ctx;

FILE *open_memstream(char **bufptr, size_t *lenptr);

/**
 * Specify the OTA signature algorithm we support on this platform.
 */
const char OTA_JsonFileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";

#ifdef CY_OTA_FLASH_SUPPORT

/**
 *  Current OTA Image State
 */
static OtaImageState_t current_ota_image_state = OtaImageStateUnknown;

/**
 * This FLASH write block used, if a block is < Block size to satisfy requirements of flash_area_write().
 */
static uint8_t block_buffer[ CY_FLASH_SIZEOF_ROW ];

/**
 * Flag to denote this is a tar file. This flag is used on subsequent chunks of file to know how to handle the data.
 */
int ota_is_tar_archive = 0;

/**
 * To keep track of the last signature check value for cy_awsport_ota_pal_set_platform_imageState
 */
static OtaPalStatus_t ota_last_sig_check;

/**
 * Signature Verification Context
 */
void *ota_sig_verify_context = NULL;

/**
 * Signature Certificate size
 */
uint32_t ota_signer_cert_size = 0;

/**
 * Pointer to Signer Certificate
 */
uint8_t  *ota_signer_cert = NULL;

/**
 * Context structure for parsing the tar file
 */
cy_untar_context_t  cy_ota_untar_context;
#endif

/*-----------------------------------------------------------*/
FILE *open_memstream(char **bufptr, size_t *lenptr)
{
    return ((FILE *)NULL);
}

/*-----------------------------------------------------------*/
#ifdef CY_OTA_FLASH_SUPPORT
/**
 * Write different sized chunks in 512 byte blocks
 */
static int ota_write_data_to_flash( const struct flash_area *fap, uint32_t offset, uint8_t * const source, uint32_t size )
{
    uint32_t bytes_to_write;
    uint32_t curr_offset;
    uint8_t *curr_src;

    bytes_to_write = size;
    curr_offset = offset;
    curr_src = source;

