Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    while( bytes_to_write > 0 )
    {
        uint32_t chunk_size = bytes_to_write;
        if( chunk_size > CY_FLASH_SIZEOF_ROW )
        {
            chunk_size = CY_FLASH_SIZEOF_ROW;
        }

        /* This should only happen on last part of last 4k chunk */
        if( chunk_size % CY_FLASH_SIZEOF_ROW )
        {
            /* we will read a 512 byte block, write out data into the block, then write the whole block */
            if( flash_area_read( fap, curr_offset, block_buffer, sizeof(block_buffer) ) != 0 )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_read() failed.\n\r" );
                return -1;
            }
            memcpy( block_buffer, curr_src, chunk_size );

            if( flash_area_write( fap, curr_offset, block_buffer, sizeof(block_buffer) ) != 0 )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_write() failed.\n\r" );
                return -1;
            }
        }
        else
        {
            if( flash_area_write( fap, curr_offset, curr_src, chunk_size ) != 0 )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_write() failed.\n\r" );
                return -1;
            }
        }

        curr_offset += chunk_size;
        curr_src += chunk_size;
        bytes_to_write -= chunk_size;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return 0;
}

/*-----------------------------------------------------------*/
/**
 * Set pending for the files contained in the TAR archive we just validated.
 */
static int ota_untar_set_pending( void )
{
    int i = 0;
    int image = 0;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    for( i = 0; i < cy_ota_untar_context.num_files_in_json; i++ )
    {
        if( strncmp( cy_ota_untar_context.files[i].type, CY_FILE_TYPE_SPE, strlen(CY_FILE_TYPE_SPE) ) == 0 )
        {
            image = 1;  /* The TFM code, cm0 */
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "FILE TYPE %d: %s \n", i, cy_ota_untar_context.files[i].type );
        }
        else if( strncmp(cy_ota_untar_context.files[i].type, CY_FILE_TYPE_NSPE, strlen(CY_FILE_TYPE_NSPE) ) == 0 )
        {
            image = 0;  /* The application code, cm4 */
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "FILE TYPE %d: %s \n", i, cy_ota_untar_context.files[i].type );
        }
        else
        {
            /* unknown file type */
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "BAD FILE TYPE %d: %s \n", i, cy_ota_untar_context.files[i].type );
            continue;
        }
        boot_set_pending( image, 0 );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return CY_UNTAR_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_untar_result_t ota_untar_write_callback( cy_untar_context_ptr ctxt, uint16_t file_index, uint8_t *buffer,
                                            uint32_t file_offset, uint32_t chunk_size, void *cb_arg )
{
    int image = 0;
    const struct flash_area *fap;
    OtaFileContext_t * const C = (OtaFileContext_t *)cb_arg;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if( (ctxt == NULL) || (buffer == NULL) || (C == NULL) )
    {
        return CY_UNTAR_ERROR;
    }

    if( strncmp( ctxt->files[file_index].type, CY_FILE_TYPE_SPE, strlen(CY_FILE_TYPE_SPE) ) == 0 )
    {
        image = 1;  /* The TFM code, cm0 */
    }
    else if( strncmp( ctxt->files[file_index].type, CY_FILE_TYPE_NSPE, strlen(CY_FILE_TYPE_NSPE) ) == 0 )
    {
        image = 0;  /* The application code, cm4 */
    }
    else
    {
        /* unknown file type */
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "BAD FILE TYPE : %s. \n\r", ctxt->files[file_index].type );
        return CY_UNTAR_ERROR;
    }

    if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY( image ), &fap ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_open(%d) failed.\n\r", image );
        return CY_UNTAR_ERROR;
    }

    if( ota_write_data_to_flash( fap, file_offset, buffer, chunk_size ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_write_data_to_flash() failed.\n\r" );
        flash_area_close( fap );
        return CY_UNTAR_ERROR;
    }

    flash_area_close( fap );
    return CY_UNTAR_SUCCESS;
}

/*-----------------------------------------------------------*/
/**
 * Initialization routine for handling tarball OTA file
 */
cy_rslt_t ota_untar_init_context( cy_untar_context_t *ctxt, OtaFileContext_t * const C )
{
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if( cy_untar_init( ctxt, ota_untar_write_callback, (void *)C ) == CY_RSLT_SUCCESS )
    {
        ota_is_tar_archive  = 1;
        return CY_RSLT_SUCCESS;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return CY_RSLT_TYPE_ERROR;
}

/*-----------------------------------------------------------*/
/**
 * Read the specified signer certificate from the filesystem into a local buffer.
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from ota_pal_file_sign_check_init(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * Returns a pointer to the signer certificate in the file system.
 * NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * ota_pal_read_assume_certificate( const uint8_t * const pucCertName, uint32_t * const ota_signer_cert_size )
{
    return ( cy_awsport_get_ota_signer_certificate( cy_aws_ota_ctx.ota_type, pucCertName, ota_signer_cert_size ) );
}

/*-----------------------------------------------------------*/
/*
 * Checks whether signature check can be skipped for the current OTA in progress
 *
 * Returns true if signature check to be skipped, false otherwise
 */
static bool ota_pal_skip_sign_check( OtaFileContext_t * const C )
{
    bool skip_sign_check = false;

    if( C != NULL )
    {
        switch( C->fileType )
        {
            case CY_AWS_IOT_OTA_TYPE_HOTA_CERT:
            case CY_AWS_IOT_OTA_TYPE_HOST_OTA:
                /* Skip validation if the signer certificate is NULL */
                if( ota_signer_cert == NULL )
                {
                   skip_sign_check = true;
                }
                break;

            default:
                break;
        }
    }
    return ( skip_sign_check );
}


/*-----------------------------------------------------------*/
/**
 * De Initialize the signature checking data
 */
static void ota_pal_file_sign_check_deinit( void )
{
    ota_sig_verify_context = NULL;
    ota_signer_cert_size = 0;

