Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if( ota_signer_cert != NULL )
    {
        vPortFree( ota_signer_cert );
        ota_signer_cert = NULL;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
}

/*-----------------------------------------------------------*/
/**
 * Initialize the signature checking for tarball OTA.
 * We keep track of the interim values for subsequent WriteBlock calls.
 * This function is used for a tarball OTA file.
 */
static OtaPalStatus_t ota_pal_file_sign_check_init( OtaFileContext_t * const C )
{
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if( C == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Parameter check failed: Input is NULL.\n\r" );
        return OtaPalNullFileContext;
    }

    /* Reset globals for incremental sign check and handle re-entrant calls */
    ota_pal_file_sign_check_deinit();

    /* Verify an ECDSA-SHA256 signature. */
    if( cy_crypto_sign_verification_start( &ota_sig_verify_context, CY_CRYPTO_ASYMMETRIC_ALGORITHM_ECDSA,
                                           CY_CRYPTO_HASH_ALGORITHM_SHA256 ) != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_crypto_sign_verification_start() failed.\n\r" );
        return OtaPalSignatureCheckFailed;
    }

    ota_signer_cert = ota_pal_read_assume_certificate( ( const uint8_t * const ) C->pCertFilepath, &ota_signer_cert_size );
    if( ota_signer_cert == NULL )
    {
        if ( ota_pal_skip_sign_check( C ) != true )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_read_assume_certificate() failed.\n\r" );
            return OtaPalBadSignerCert;
        }
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return OtaPalSuccess;
}

/*-----------------------------------------------------------*/
/**
 * Do the final Signature Check for tarball OTA.
 * This function is used for a tarball OTA file.
 * This function is called from cy_awsport_ota_flash_close_receive_file().
 */
static OtaPalStatus_t ota_pal_file_sign_check_final( OtaFileContext_t * const C )
{
    OtaPalStatus_t   result = OtaPalSuccess;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if ( (C == NULL) || (C != cy_aws_ota_ctx.ota_fs_ctx) || (ota_sig_verify_context == NULL) )
    {
        /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
        ota_pal_file_sign_check_deinit();
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_file_sign_check_final failed\n\r" );
        return OtaPalBadSignerCert;
    }

    if( ( ota_pal_skip_sign_check( C ) != true ) && ( ( ota_signer_cert == NULL ) || ( ota_signer_cert_size == 0 ) ) )
    {
        ota_pal_file_sign_check_deinit();
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_file_sign_check_final failed\n\r" );
        return OtaPalBadSignerCert;
    }

    if( cy_crypto_sign_verification_final( ota_sig_verify_context, ( char * ) ota_signer_cert, ota_signer_cert_size,
                                           C->pSignature->data, C->pSignature->size ) != CY_RSLT_SUCCESS )
    {
        if( ota_pal_skip_sign_check( C ) != true )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_crypto_sign_verification_final() failed.\n\r" );
            result = OtaPalSignatureCheckFailed;
        }
    }
    ota_last_sig_check = result;

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    ota_pal_file_sign_check_deinit();
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return result;
}

/*-----------------------------------------------------------*/
/**
 * Incremental update of the signature for tarball OTA.
 * This function is used for a tarball OTA file.
 * This function is called from cy_awsport_ota_pal_write_block().
 */
static OtaPalStatus_t ota_pal_file_sign_check_step( OtaFileContext_t * const C, uint8_t * buffer, uint32_t size )
{
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    if( (C == NULL) || (C != cy_aws_ota_ctx.ota_fs_ctx ) || (ota_sig_verify_context == NULL) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, " Bad Arguments...!\n\r" );
        /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
        ota_pal_file_sign_check_deinit();
        if( ota_sig_verify_context == NULL )
        {
            return OtaPalBadSignerCert;
        }
        return OtaPalSignatureCheckFailed;
    }
    if( ota_pal_skip_sign_check( C ) != true )
    {
        cy_crypto_sign_verification_update( ota_sig_verify_context, buffer, size );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return OtaPalSuccess;
}

/*-----------------------------------------------------------*/
/**
 * Erase the second slot to prepare for writing OTA image file.
 */
static int ota_erase_slot_two( void )
{
    const struct flash_area *fap;
    int image;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    /* MCUBLOOT_IMAGE_NUMBER == 2, will erase both Secondary slot 1 and 2 */
    for( image = 0; image < MCUBOOT_IMAGE_NUMBER; image++ )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_open for %d...\n\r.", image );
        if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY(image), &fap ) != 0 )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_open(FLASH_AREA_IMAGE_SECONDARY(%d)) failed...\n\r", image );
            return -1;
        }
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Completed flash_area_open ...\n\r." );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_erase ...\n\r." );
        if( flash_area_erase( fap, 0, fap->fa_size ) != 0 )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_erase(fap, 0) (image:%d) failed...\n", image );
            return -1;
        }
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Completed flash_area_erase ...\n\r." );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_close ...\n\r." );
        flash_area_close( fap );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Completed flash_area_close ...\n\r." );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return 0;
}
#endif

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_flash_init( void )
{
    cy_rslt_t cy_result = CY_RSLT_SUCCESS;

    (void)open_memstream(NULL, NULL);
#ifdef CY_OTA_FLASH_SUPPORT
    bool ota_mutex_init_status = false;

