Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    /* Clear the MQTT handle data. */
    memset( &cy_aws_ota_ctx, 0x00, sizeof( cy_awsport_ota_flash_ctx_t ) );

    cy_result = cy_rtos_init_mutex2( &(cy_aws_ota_ctx.ota_sync_mutex), false );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Creating OTA mutex %p. failed", cy_aws_ota_ctx.ota_sync_mutex );
        return cy_result;
    }

    ota_mutex_init_status = true;

#ifdef CY_BOOT_USE_EXTERNAL_FLASH
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "psoc6_qspi_init started...\n\r" );
    cy_result = psoc6_qspi_init();
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "psoc6_qspi_init() FAILED!!\n\r" );
        cy_result = CY_RSLT_AWS_IOT_PORT_ERROR_INIT_STORAGE;
        goto exit;
    }
    else
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "psoc6_qspi_init completed...\n\r ");
    }
#endif /* CY_BOOT_USE_EXTERNAL_FLASH */

exit :
    if( cy_result != CY_RSLT_SUCCESS )
    {
        if( ota_mutex_init_status == true )
        {
            (void)cy_rtos_deinit_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
            ota_mutex_init_status = false;
        }
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif
    return cy_result;
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_abort( OtaFileContext_t * const C )
{
    cy_rslt_t        cy_result = CY_RSLT_SUCCESS;
    OtaPalStatus_t   result = OtaPalSuccess;

#ifdef CY_OTA_FLASH_SUPPORT
    const struct flash_area *fap;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)result );
        return OTA_PAL_COMBINE_ERR( OtaPalAbortFailed, 0 );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    if ( (C == NULL) || (C != cy_aws_ota_ctx.ota_fs_ctx) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid file context.\n\r" );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return OTA_PAL_COMBINE_ERR( OtaPalNullFileContext, 0 );
    }

    if( C->pFile == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid file handle.\n\r" );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return OTA_PAL_COMBINE_ERR( OtaPalNullFileContext, 0 );
    }

    fap = (const struct flash_area *)C->pFile;
    if( fap != NULL )
    {
        flash_area_close( fap );
    }

    /* reset our globals */
    C->pFile = NULL;
    cy_aws_ota_ctx.ota_fs_ctx = NULL;
    cy_aws_ota_ctx.ota_type = CY_AWS_IOT_OTA_TYPE_INVALID;

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    ota_pal_file_sign_check_deinit();

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return OTA_PAL_COMBINE_ERR( OtaPalAbortFailed, 0 );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    (void)cy_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return OTA_PAL_COMBINE_ERR( result, 0 );
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_create_receive_file( OtaFileContext_t * const C )
{
    cy_rslt_t        cy_result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    const struct     flash_area *fap;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    if( C == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid file context.\n\r" );
        return OTA_PAL_COMBINE_ERR( OtaPalNullFileContext, 0 );
    }

    if( C->pFilePath == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_WARNING, "Invalid file path provided.\n\r" );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Complete OTA image size : %ld bytes \n\r", C->fileSize );

    /* prepare the slot for writing */
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Erasing slot 2 started...\n\r" );
    ota_erase_slot_two();
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Erasing slot 2 completed.\n\r" );

    /* Must set something into lFileHandle and we use for MQTT downloads */
    if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY(0), &fap ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "OTA receive file creation failed...\n\r " );
        return OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }

    /* NOTE: FileHandle MUST be non-NULL of the OTA Agent will error out */
    C->pFile = (uint8_t *)fap;

    /* initialize these for checking later */
    ota_last_sig_check = OtaPalUninitialized;
    ota_sig_verify_context = NULL;
    ota_signer_cert = NULL;
    ota_signer_cert_size = 0;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

