Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_aws_ota_ctx.ota_fs_ctx = C;
    cy_aws_ota_ctx.ota_flash_start_address = fap->fa_off;
    cy_aws_ota_ctx.ota_type = (cy_ota_type_t)C->fileType;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Updated OTA context... \n\r" );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "OTA receive file created.\n\r" );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    (void)cy_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_close_receive_file( OtaFileContext_t * const C )
{
    cy_rslt_t        cy_result = CY_RSLT_SUCCESS;
    OtaPalStatus_t   result = OtaPalSuccess;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)result );
        result = OtaPalFileClose;
        goto _exit_CloseFile;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    if ( (C == NULL) || (C != cy_aws_ota_ctx.ota_fs_ctx ) || (C->pFile == NULL))
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid file context.\n\r" );
        result = OtaPalFileClose;
        goto _exit_CloseFile;
    }

    /* we got the data, try to verify it */
    if( C->pSignature == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "OTA signature structure is NULL.\n\r" );
        result = OtaPalSignatureCheckFailed;
        goto _exit_CloseFile;
    }

    /* For TAR files, we must use HTTP transport so that the file blocks come down
     * in sequential order - we need start of TAR (components.json) first, and we
     * do not store all of the blocks. Signature must be checked in sequential order.
     */
    if( ota_is_tar_archive == 1 )
    {
        /* Do the final check for signature */
        if( ota_pal_file_sign_check_final(C) != OtaPalSuccess )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "TAR ota_pal_file_sign_check_final() failed.\n\r" );
            ota_erase_slot_two();
            result = OtaPalSignatureCheckFailed;
        }
    }
    else
    {
        /* Non-tar OTA, we downloaded a single file, might have been MQTT.
         * If MQTT, the file blocks may come in non-sequential order.
         * We need to run signature check across entire downloaded file at once.
         */
        const struct flash_area *fap = NULL;

        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "BINARY file, check whole file for signature.\n\r" );
        fap = (const struct flash_area *)C->pFile;
        if( fap == NULL )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR: fap == NULL.\n\r" );
            result = OtaPalSignatureCheckFailed;
            goto _exit_CloseFile;
        }

        result = ota_pal_file_sign_check_init( C );
        if( result == OtaPalSuccess )
        {
            uint32_t addr;
            addr = 0;
            while( addr < C->fileSize )
            {
                uint32_t toread = C->fileSize - addr;
                /* Re-use coalesce buffer as we have completed download (it is not used for non-TAR OTA) */
                if( toread > sizeof(cy_ota_untar_context.coalesce_buffer) )
                {
                    toread = sizeof( cy_ota_untar_context.coalesce_buffer );
                }

                if( flash_area_read( fap, addr, cy_ota_untar_context.coalesce_buffer, toread ) < 0 )
                {
                    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_read() failed for signature check.\n\r" );
                    result = OtaPalSignatureCheckFailed;
                    goto _exit_CloseFile;
                }

                cy_crypto_sign_verification_update( ota_sig_verify_context, cy_ota_untar_context.coalesce_buffer, toread );
                addr += toread;
            }
            if( ota_pal_file_sign_check_final( C ) != OtaPalSuccess )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_file_sign_check_final() failed.\n\r" );
                ota_erase_slot_two();
                result = OtaPalSignatureCheckFailed;
            }
        }
        else
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_file_sign_check_init() failed.\n\r" );
            ota_erase_slot_two();
            result = OtaPalSignatureCheckFailed;
        }
    }
    if(result == OtaPalSuccess)
    {
        uint32_t off;
        int rc = 0;
        const struct flash_area *fap;

        fap = (const struct flash_area *)C->pFile;

        /* For Device OTA, Remove the boot magic if present.
         * Boot magic is added when the user applies image.
         */
        if(fap != NULL && C->fileType == CY_AWS_IOT_OTA_TYPE_DEVICE_OTA)
        {
            uint8_t magic_erase[BOOT_MAGIC_SZ];

            off = fap->fa_size - BOOT_MAGIC_SZ;
            memset( &magic_erase, 0xFF, BOOT_MAGIC_SZ );

            /* Clear the magic num if any */
            rc = flash_area_write( fap, off, &magic_erase, BOOT_MAGIC_SZ );
            if( rc != 0 )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to remove boot_magic.\n" );
            }
        }
    }

