Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
_exit_CloseFile:
    if ( C != NULL && C->pFile != NULL )
    {
        const struct flash_area *fap;
        fap = (const struct flash_area *)C->pFile;
        flash_area_close( fap );
    }

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    ota_pal_file_sign_check_deinit();

    if( result != OtaPalSuccess )
    {
        current_ota_image_state = OtaImageStateUnknown;
        cy_aws_ota_ctx.ota_type = CY_AWS_IOT_OTA_TYPE_INVALID;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        result = OtaPalFileClose;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    (void)cy_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return OTA_PAL_COMBINE_ERR( result, 0 );
}

/*-----------------------------------------------------------*/
int16_t cy_awsport_ota_flash_write_block( OtaFileContext_t * const C, uint32_t ulOffset,
                                          uint8_t * const pcData, uint32_t ulBlockSize )
{
    cy_rslt_t        cy_result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return -1;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    if( (C == NULL) || (C != cy_aws_ota_ctx.ota_fs_ctx ) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid file context.\n\r" );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return -1;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "ulOffset = %ld \n\r", ulOffset );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "ulBlockSize = %ld \n\r", ulBlockSize );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Number of blocks remaining in OTA image : %ld \n\r", C->blocksRemaining );

    /* we need to check some things when we receive the first block */
    if( ulOffset == 0UL )
    {
        /* Initialize file signature checking */
        if( ota_pal_file_sign_check_init( C ) != OtaPalSuccess )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_pal_file_sign_check_init() FAILED.\n\r" );
            (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
            return -1;
        }

        /*
         * Check for incoming tarball (as opposed to a single file OTA)
         */
        if( cy_is_tar_header( pcData, ulBlockSize ) == CY_UNTAR_SUCCESS )
        {
            if( ota_untar_init_context( &cy_ota_untar_context, C ) != CY_RSLT_SUCCESS )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "ota_untar_init_context() FAILED! \n\r" );
                (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
                return -1;
            }
        }
    }

    /* Treat a tar file differently from a "normal" OTA */
    if( ota_is_tar_archive != 0 )
    {
        uint32_t consumed = 0;

        /* check the signature incrementally over every block received */
        if( ota_pal_file_sign_check_step( C, pcData, ulBlockSize) != OtaPalSuccess )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "FileSignatureCheckStep() offset:%ld FAILED!\n", ulOffset );
            (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
            return -1;
        }

        while( consumed < ulBlockSize )
        {
            cy_untar_result_t result;
            result = cy_untar_parse( &cy_ota_untar_context, (ulOffset + consumed), &pcData[consumed], (ulBlockSize- consumed), &consumed );
            if( (result == CY_UNTAR_ERROR) || (result == CY_UNTAR_INVALID))
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_untar_parse() FAIL. consumed: %ld block size: %ld result : %ld!\n", consumed, ulBlockSize, result );
                (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
                return -1;
            }
            /* Yield for a bit */
            cy_rtos_delay_milliseconds( 1 );
        }

        /* with the tarball we get a version - check if it is > current so we can bail early */
#ifdef CY_TEST_APP_VERSION_IN_TAR
        if( cy_ota_untar_context.version[0] != 0 )
        {
            /* example version string "<major>.<minor>.<build>" */
            uint16_t major = 0;
            uint16_t minor = 0;
            uint16_t build = 0;
            char *dot;
            major = atoi( cy_ota_untar_context.version );
            dot = strstr( cy_ota_untar_context.version, "." );
            if( dot != NULL )
            {
                dot++;
                minor = atoi( dot );
                dot = strstr( dot, "." );
                if( dot != NULL )
                {
                    dot++;
                    build = atoi( dot );

                    if( (major < APP_VERSION_MAJOR) ||
                          ( (major == APP_VERSION_MAJOR) &&
                            (minor < APP_VERSION_MINOR)) ||
                          ( (major == APP_VERSION_MAJOR) &&
                            (minor == APP_VERSION_MINOR) &&
                            (build <= APP_VERSION_BUILD)) )
                    {
                        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "OTA image version %d.%d.%d <= current %d.%d.%d-- bail!\n\r",
                                       major, minor, build, APP_VERSION_MAJOR, APP_VERSION_MINOR, APP_VERSION_BUILD );
                        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
                        return -1;
                    }
                }
            }
        }
#endif  /* CY_TEST_APP_VERSION_IN_TAR */
    }
    else
    {
        /* non-tarball OTA here */
        const struct flash_area *fap;
        fap = (const struct flash_area *)C->pFile;
        if( fap == NULL )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_pointer is NULL.\n\r" );
            (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
            return -1;
        }

        if( ota_write_data_to_flash( fap, ulOffset, pcData, ulBlockSize ) == -1 )
        {
            (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
            return -1;
        }
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    (void)cy_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return ulBlockSize;
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_activate_newimage( OtaFileContext_t * const C )
{
    OtaPalMainStatus_t result = OtaPalSuccess;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    /* Mark this new OTA image as pending, it will be the permanent bootable image going forward. */
    if( (ota_is_tar_archive != 0) && (cy_ota_untar_context.magic == CY_UNTAR_CONTEXT_MAGIC) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "TAR ota_pal_file_sign_check_final() GOOD.\n\r" );
        ota_untar_set_pending();
    }
    else
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "BIN ota_pal_file_sign_check_final() GOOD.\n\r" );
        /* Non-tar only has type 0 (NSPE) update */
        boot_set_pending( 0, 0 );
    }

    result = cy_awsport_ota_flash_reset_device( C );
    if( OTA_PAL_MAIN_ERR( result ) != OtaPalSuccess )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "cy_awsport_ota_flash_reset_device failed.\n\r" );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return result;
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_set_platform_imagestate( OtaFileContext_t * const C,
                                                             OtaImageState_t eState )
{
    OtaPalStatus_t   result = OtaPalSuccess;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

