Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Current OTA image state : %d \n\r", (int)current_ota_image_state );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "New OTA image state : %d \n\r", (int)eState );

    if( eState == OtaImageStateUnknown || eState > OtaLastImageState )
    {
        return OTA_PAL_COMBINE_ERR( OtaPalBadImageState, 0 );
    }

    if( cy_aws_ota_ctx.ota_fs_ctx == NULL )
    {
        /* We are not currently loading an OTA image. This state change pertains to Slot 0 image */
        switch( eState )
        {
            case OtaImageStateAccepted:
                /* Mark Slot 0 image as valid. */
                /* We need to know if the last check was good... */
                if( ota_last_sig_check == OtaPalSuccess )
                {
                    boot_set_confirmed();
                    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Boot Set confirmed.\n\r" );
                }
                else
                {
                    result = OtaPalCommitFailed;
                }
                break;
            case OtaImageStateRejected:
                /* we haven't closed the file, and the OTA Agent has rejected the download */
                result = OtaPalSuccess;
                break;
            case OtaImageStateAborted:
                /* We are not actively downloading, this pertains to an invalid download job
                 * or an aborted job. We erase secondary slot when we start a new download,
                 * and do not consider secondary slot ready unless download completes and
                 * signature checked. nothing to do here, but set our state to Accepted so
                 * we store it for GetImageState().
                 */
                eState = OtaImageStateAccepted;
                break;
            case OtaImageStateTesting:
                break;
            default:
                result = OtaPalBadImageState;
                break;
        }
    }
    else
    {
        /* We are in the middle of a new download
         * Abort or Reject refers to the new download, not the primary slot.
         * Nothing to do here.
         */
        if( eState == OtaImageStateAccepted )
        {
            if( cy_aws_ota_ctx.ota_fs_ctx->pFile != NULL )
            {
                result = OtaPalCommitFailed;
            }
        }
    }

    /* keep track of the state OTA Agent sent. */
    current_ota_image_state = eState;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Current OTA image eSTATE : %d \n\r", eState );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return OTA_PAL_COMBINE_ERR( result, 0 );
}

/*-----------------------------------------------------------*/
OtaPalImageState_t cy_awsport_ota_flash_get_platform_imagestate( OtaFileContext_t * const C )
{
    OtaPalImageState_t result = OtaPalImageStateUnknown;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\n\rCurrent OTA image eSTATE : %d \n\r", current_ota_image_state );

    /**
     * After swap/copy of secondary slot to primary slot, boot_swap_type() returns NONE.
     * It does not reflect the fact we may be in self-test mode.
     * Use the saved value from SetImageState() to report our status.
     */
    if( current_ota_image_state == OtaImageStateTesting )
    {
        /* in self-test, report Pending. */
        result = OtaPalImageStatePendingCommit;
    }
    else if( (current_ota_image_state == OtaImageStateRejected ) ||
             (current_ota_image_state == OtaImageStateAborted ) )
    {
        result = OtaPalImageStateInvalid;
    }
    else if( current_ota_image_state == OtaImageStateAccepted )
    {
        result = OtaPalImageStateValid;
    }
    else
    {
        result = OtaPalImageStateUnknown;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Platform Image state : %d \n\r", (int)result );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return result;
}

/*-----------------------------------------------------------*/
OtaPalStatus_t cy_awsport_ota_flash_reset_device( OtaFileContext_t * const C )
{
    ( void ) C;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

#ifdef CY_OTA_FLASH_SUPPORT
    /* we want to wait a bit when in DEBUG builds so the logging mechanism can finish before resetting. */
    cy_rtos_delay_milliseconds( 1000UL );
    /* Really not an error. Wanted to print restart message with highest priority. */
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n\n\rRESETTING NOW....... !!!!\n\r" );
    cy_rtos_delay_milliseconds( 1000UL );
    NVIC_SystemReset();
#endif

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_flash_image_validate( void )
{
    int16_t boot_result = 0;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

#ifdef CY_OTA_FLASH_SUPPORT
    /* Mark Image in Primary Slot as valid.   */
    boot_result = boot_set_confirmed();
    if( boot_result != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
        return CY_RSLT_AWS_IOT_PORT_ERROR_GENERAL;
    }

#else
    (void)boot_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_remove_boot_magic(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    const struct flash_area *fap;
    int rc = 0;
    uint32_t off = 0;

