Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );
    rc = flash_area_open( FLASH_AREA_IMAGE_SECONDARY(0), &fap );
    if(rc != 0)
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get flash handle.\n" );
        result = CY_RSLT_AWS_IOT_PORT_ERROR_GENERAL;
    }
    else
    {
        uint8_t magic_erase[BOOT_MAGIC_SZ];

        off = fap->fa_size - BOOT_MAGIC_SZ;
        memset( &magic_erase, 0xFF, BOOT_MAGIC_SZ );

        rc = flash_area_write( fap, off, &magic_erase, BOOT_MAGIC_SZ );
        if( rc != 0 )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to remove boot_magic.\n" );
            result = CY_RSLT_AWS_IOT_PORT_ERROR_GENERAL;
        }
        flash_area_close( fap );
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif
    return result;
}

/*-----------------------------------------------------------*/
void * cy_awsport_ota_flash_get_handle( void )
{
    cy_rslt_t    cy_result = CY_RSLT_SUCCESS;
    void         *flash_handle = NULL;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        flash_handle = NULL;
        goto exit;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    if( cy_aws_ota_ctx.ota_fs_ctx != NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "OTA flash storage handle = %p \n\r", cy_aws_ota_ctx.ota_fs_ctx );
        flash_handle = ( void *)cy_aws_ota_ctx.ota_fs_ctx;
    }
    else
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "OTA flash storage is NULL...!!! \n\r" );
        flash_handle = NULL;
        goto exit;
    }

exit :
    if( cy_result == CY_RSLT_SUCCESS )
    {
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    (void)cy_result;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return flash_handle;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_flash_read( uint32_t bytes_to_read, uint8_t * const read_buf,
                                     uint32_t read_buf_size, uint32_t *bytes_received )
{
    cy_rslt_t    cy_result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    uint8_t      flash_id = 0;
    int          rc = 0;
    uint32_t     invalid_bytes = 0;
    const struct flash_area     *fap = NULL;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    if( (read_buf == NULL) || (bytes_to_read < 0) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arg to read.\n\r" );
        return CY_RSLT_AWS_IOT_PORT_ERROR_BADARG;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return CY_RSLT_AWS_IOT_PORT_ERROR_READ_STORAGE;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    if( cy_aws_ota_ctx.ota_type == CY_AWS_IOT_OTA_TYPE_DEVICE_OTA )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Read is not allowed for device OTA \n\r" );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return CY_RSLT_AWS_IOT_PORT_ERROR_READ_STORAGE;
    }

    flash_id = FLASH_AREA_IMAGE_SECONDARY(0);

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Current read offset = %ld \n\r", cy_aws_ota_ctx.ota_flash_read_offset );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Requested bytes = %ld \n\r", bytes_to_read );

    /* Always read from secondary slot */
    if( flash_area_open( flash_id, &fap ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "flash_area_open(FLASH_AREA_IMAGE_SECONDARY(0) ) failed\r\n" );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return CY_RSLT_AWS_IOT_PORT_ERROR_OPEN_STORAGE;
    }

    /* read into the chunk_info buffer */
    rc = flash_area_read( fap, cy_aws_ota_ctx.ota_flash_read_offset, read_buf, bytes_to_read );
    if( rc != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_read() failed result:%d \n\r", __func__, rc );
        flash_area_close( fap );
        (void)cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
        return CY_RSLT_AWS_IOT_PORT_ERROR_READ_STORAGE;
    }

    if( (cy_aws_ota_ctx.ota_flash_start_address + fap->fa_size) < (cy_aws_ota_ctx.ota_flash_start_address + cy_aws_ota_ctx.ota_flash_read_offset + bytes_to_read) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Reading beyond HOTA storage space...!!! \n\r" );
        invalid_bytes = cy_aws_ota_ctx.ota_flash_start_address + cy_aws_ota_ctx.ota_flash_read_offset + bytes_to_read;
        invalid_bytes -=  (cy_aws_ota_ctx.ota_flash_start_address + fap->fa_size);
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Last %ld bytes in read buffer are invalid...!!! \n\r", invalid_bytes );
    }

