Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/ota/cy_aws_ota_storage.c
    *bytes_received = bytes_to_read - invalid_bytes;

    flash_area_close( fap );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        cy_result = CY_RSLT_AWS_IOT_PORT_ERROR_READ_STORAGE;
    }
    else
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return cy_result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_flash_seek( uint32_t offset )
{
    cy_rslt_t cy_result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquiring OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_get_mutex( &(cy_aws_ota_ctx.ota_sync_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Acquiring OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return CY_RSLT_AWS_IOT_PORT_ERROR_READ_STORAGE;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Acquired OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );

    cy_aws_ota_ctx.ota_flash_read_offset = offset;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Releasing OTA Mutex %p \n\r", cy_aws_ota_ctx.ota_sync_mutex );
    cy_result = cy_rtos_set_mutex( &(cy_aws_ota_ctx.ota_sync_mutex) );
    if( cy_result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release OTA Mutex %p failed with Error : [0x%X] \n\r", cy_aws_ota_ctx.ota_sync_mutex, (unsigned int)cy_result );
        return cy_result;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nReleased OTA Mutex %p ", cy_aws_ota_ctx.ota_sync_mutex );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif

    return cy_result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_awsport_ota_flash_erase( uint8_t flash_id )
{
    cy_rslt_t cy_result = CY_RSLT_SUCCESS;

#ifdef CY_OTA_FLASH_SUPPORT
    const struct flash_area *fap;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() start ....\n\r", __func__ );

    cy_aws_ota_ctx.ota_type = CY_AWS_IOT_OTA_TYPE_INVALID;

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_open for %d...\n\r.", flash_id );
    if( flash_area_open( flash_id, &fap ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_open(FLASH_AREA_IMAGE_SECONDARY(%d)) failed...\n\r", flash_id );
        return CY_RSLT_AWS_IOT_PORT_ERROR_OPEN_STORAGE;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Completed flash_area_open ...\n\r." );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_erase ...\n\r." );
    if( flash_area_erase( fap, 0, fap->fa_size ) != 0 )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "flash_area_erase(fap, 0) (flash_id:%d) failed...\n", flash_id );
        return CY_RSLT_AWS_IOT_PORT_ERROR_GENERAL;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Completed flash_area_erase ...\n\r." );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start flash_area_close ...\n\r." );
    flash_area_close( fap );
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Completed flash_area_close ...\n\r." );

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() end ....\n\r", __func__ );
#else
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Flash support is not added\n" );
#endif
    return cy_result;
}
/*-----------------------------------------------------------*/
